{
  "concept_id": "5649",
  "concept_data": {
    "title": "management of the external borders of the European Union",
    "category_code": "1231",
    "category_name": "international law",
    "category_full": "1231 international law",
    "is_redirect": true,
    "preferred_term": "external border of the EU",
    "relation_type": "USE"
  },
  "summary": "The \"management of the external borders of the European Union\" refers to the regulatory framework governing the control and security of the EU's external frontiers. This concept, often redirected to the preferred term \"external border of the EU,\" encompasses various legal instruments and policies aimed at appropriating resources for border management. It involves cooperation among member states, including the sharing of information and best practices, to ensure the undeniable integrity of borders. The framework addresses issues such as nationalities, asylum procedures, and the flanking of borders against unauthorized access. Notable ports like Gdańsk and Southampton serve as critical termināls for monitoring and controlling maritime traffic, while airports such as Malpensa and Horta are pivotal for air travel regulation. The EU's approach also includes the integration of technology and infrastructure, ensuring that the management of external borders is both effective and compliant with international law, as seen in the context of agreements with countries like Micronesia and Nauru.",
  "metadata": {
    "generation_date": "2025-07-29T22:59:41.889708",
    "model_used": "gpt-4o-mini",
    "summary_length_target": 100,
    "actual_word_count": 157,
    "vocabulary_stats": {
      "total_related_words": 1515,
      "requested_words": 150,
      "min_frequency_found": 5,
      "max_frequency_found": 4108,
      "selected_words": 150,
      "selected_min_freq": 5,
      "selected_max_freq": 55,
      "selected_avg_freq": 22.893333333333334
    },
    "related_words": [
      "ftd",
      "frtd",
      "argo",
      "appropriating",
      "overturn",
      "suceeded",
      "divulged",
      "astakos",
      "avia",
      "zaventem",
      "koidula",
      "luhamaa",
      "sintermar",
      "kravu",
      "termināls",
      "vlissingen",
      "horta",
      "southampton",
      "gdańsk",
      "exupéry",
      "aéroport",
      "malpensa",
      "baltmarine",
      "hirtshals",
      "billund",
      "kalundborg",
      "frigo",
      "altenwerder",
      "kirchtal",
      "neos"
    ],
    "prompt_length": 1732,
    "category": "1231 international law"
  }
}