{
  "concept_id": "2696",
  "concept_data": {
    "title": "anti-subsidy proceeding",
    "category_code": "4031",
    "category_name": "competition",
    "category_full": "4031 competition",
    "is_redirect": false,
    "preferred_term": null,
    "relation_type": null
  },
  "summary": "An \"anti-subsidy proceeding\" is a crucial legal mechanism within EU competition law aimed at addressing unfair trade practices. These proceedings are initiated when a member state or the EU identifies that a non-EU country is providing provisional financial support to its industries, leading to distorted competition in the internal market. Such subsidies can be misguided, resulting in a competitive disadvantage for EU businesses, particularly in sectors like workwear and linens from regions such as Gujarat or Kerala. The proceedings involve rigorous investigations, where evidence is meticulously gathered to establish the existence of these subsidies, ensuring that any imposed measures are mathematically justified and undisputable. The process may also involve consultations with various stakeholders, including companies like Himatsingka and Ghcl, to assess the economic impact and informaton necessary for fair adjudication. Ultimately, the goal is to maintain a balanced competitive environment, preventing the misuse of subsidies that could misplace market dynamics.",
  "metadata": {
    "generation_date": "2025-07-29T20:04:16.044428",
    "model_used": "gpt-4o-mini",
    "summary_length_target": 100,
    "actual_word_count": 150,
    "vocabulary_stats": {
      "total_related_words": 1517,
      "requested_words": 150,
      "min_frequency_found": 4,
      "max_frequency_found": 4108,
      "selected_words": 150,
      "selected_min_freq": 4,
      "selected_max_freq": 31,
      "selected_avg_freq": 11.14
    },
    "related_words": [
      "privisonal",
      "dihydromyrcenol",
      "destilaciones",
      "bordas",
      "chinchurreta",
      "sensient",
      "kashmiri",
      "lal",
      "tarun",
      "khanna",
      "amritsar",
      "polyweaves",
      "fashions",
      "kerala",
      "kalam",
      "himatsingka",
      "linens",
      "shetty",
      "tavoy",
      "workwear",
      "orient",
      "haryana",
      "ghcl",
      "gujarat",
      "vijayeswari",
      "nest",
      "prakash",
      "sotexpa",
      "qualidis",
      "bks"
    ],
    "prompt_length": 1658,
    "category": "4031 competition"
  }
}